MHD/Blishchik_cases/hunt_mhdEpotMultiRegionFoam_Ha20/constant/walls/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/walls/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    frontAndBack
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2400;
        startFace       54800;
    }
    topWall
    {
        type            mappedWall;
        inGroups        2(wall mappedPatch);
        nFaces          2000;
        startFace       57200;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     botWall;
    }
    botWall
    {
        type            mappedWall;
        inGroups        2(wall mappedPatch);
        nFaces          2000;
        startFace       59200;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     topWall;
    }
    leftAndRight
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4000;
        startFace       61200;
    }
)

// ************************************************************************* //
