MHD/Blishchik_cases/hunt_mhdEpotMultiRegionFoam_Ha20/system/walls/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 -1 -1.1)
    (20 -1 -1.1)
    (20 1 -1.1)
    (0 1 -1.1)
    (0 -1 -1)
    (20 -1 -1)
    (20 1 -1)
    (0 1 -1)
    (0 -1 1)
    (20 -1 1)
    (20 1 1)
    (0 1 1)
    (0 -1 1.1)
    (20 -1 1.1)
    (20 1 1.1)
    (0 1 1.1)
);

blocks

(
    hex (0 1 2 3 4 5 6 7) (100 20 5)
    simpleGrading 
    (1
    (                
        (0.5 0.5 10)
        (0.5 0.5 0.1)
    )
    0.5)    
    hex (8 9 10 11 12 13 14 15) (100 20 5)
    simpleGrading
    (1  
    (                
        (0.5 0.5 10)
        (0.5 0.5 0.1)
    )
    2)    
);
edges
(
);

boundary
(
    frontAndBack
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (8 12 15 11)
            (9 13 14 10)
            (0 1 2 3)
        );
    }

    topWall
    {
        type            mappedWall;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     botWall;
        faces
        (
            (4 5 6 7)
        );
    }

    botWall
    {
        type            mappedWall;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     topWall;
        faces
        (
            (8 9 10 11)
        );
    }

    leftAndRight
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
            (11 15 14 10)
            (8 12 13 9)
            (12 13 14 15)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
